Repository: puthsitha/moone
Catalog: lib/l10n/arb/app_*.arb
Languages: km

# counterAppBarTitle
source: Counter
km: បញ្ជរ

# please_turn_on_permission
source: Please turn on {permissionType} permission
km: សូមបើកការអនុញ្ញាត {permissionType}

# open_setting
source: Open Settings
km: បើកការកំណត់

source: Photo
km: រូបភាព

source: Camera
km: កាមេរ៉ា

source: Record
km: កំណត់ត្រា

source: Report
km: របាយការណ៍

source: Setting
km: ការកំណត់

source: Money Tracker
km: តាមតានលុយ

source: Good Morning
km: អរុណសួស្តី

source: Good Afternoon
km: ទិវាសួស្ដី

source: Good Evening
km: សាយ័ណ្ហសួស្ដី

source: Good night
km: រាត្រីសួស្តី

# view_all_record
source: View all your record
km: មើលកំណត់ត្រារបស់អ្នកទាំងអស់

source: Add Tracking
km: បន្ថែមការតាមដាន

# record_new_tracking
source: Record a new tracking
km: កត់ត្រាការតាមដានថ្មី

# view_insights_analytics
source: View insights and analytics
km: មើលការយល់ដឹងនិងវិភាគ

source: Quick Stats
km: ស្ថិតិរហ័ស

source: Income
km: ចំណូល

source: Expenses
km: ចំណាយ

source: Balance
km: សាច់ប្រាក់

source: Expense
km: ចំណាយ

source: Saving
km: សន្សំ

source: Search by title
km: ស្វែងរកតាមចំណងជើង

source: Filter
km: ជ្រើសរើស

source: Type
km: ប្រភេទ

source: Category
km: កាតាឡុក

source: Cancel
km: បោះបង់

source: Apply
km: ជ្រើសយក

source: Select Month & Year
km: ជ្រើសរើសខែ និងឆ្នាំ

source: All
km: ទាំងអស់

source: Budget
km: ថវិកា

source: Remaining
km: នៅសល់

source: Monthly Budget
km: ថវិកា ប្រចាំខែ

source: Copyright
km: រក្សាសិទ្ធិ

source: Version
km: កំណែទម្រង់

source: Language
km: ភាសា

# press_here_change_language
source: Press here to change language
km: ចុចទីនេះដើម្បីប្តូរភាសា

source: Customize theme appearance
km: ប្ដូររូបរាងកម្មវិធីតាមបំណង

source: Theme
km: ដូរពណ៍កម្មវិធី

source: Save
km: រក្សាទុក

source: Dark Mode
km: ផ្ទាំងងងឹត

source: Light Mode
km: ផ្ទាំងភ្លឺ

source: System Default
km: ផ្ទាំងដូចទូរស័ព្ទ

# dark_mode_description
source: App look darker.
km: កម្មវិធីនេះនឹងប្រើផ្ទាំងងងឹត

source: Total Balance
km: សមតុល្យសរុប

source: Total Expense
km: ការចំណាយសរុប

# total_icome
source: Total Income
km: ប្រាក់ចំណូលសរុប

source: Month
km: ខែ

# no_budget
source: No budgets
km: គ្មានថវិកាទេ

# set_budget_for
source: Set Budget for {budget}
km: កំណត់ថវិកាសម្រាប់ {budget}

source: Budget Amount
km: ចំនួនទឹកប្រាក់ថវិកា

source: Enter budget amount
km: បញ្ចូលចំនួនទឹកប្រាក់ថវិកា

source: Budget Setting
km: ការកំណត់ថវិកា

# no_budget_available
source: No budgets available
km: មិនមានថវិកាទេ

source: Clear Budget Value
km: សម្អាតតម្លៃថវិកា

# are_u_sure_remove_budget_value
source: Are you sure you want to remove the value of
km: តើអ្នកពិតជាចង់លុបតម្លៃរបស់

source: Remove
km: លុបចេញ

source: Edit
km: កែប្រែ

source: Detail
km: លម្អិត

source: Amount
km: ចំនួន

source: Date
km: កាលបរិច្ឆេទ

# are_u_sure_remove_tracking
source: Are you sure you want to remove this tracking?
km: តើអ្នកពិតជាចង់លុបមែនទេ?

source: Add Categories
km: ថែម កាតាឡុក

# no_type_category
source: No {type} categories yet.
km: មិនមានកាតាឡុក{type}ឡើយ.

source: Delete Category
km: លុបកាតាឡុក

# are_u_sure_delete_category
source: Are you sure you want to delete this category? This action cannot be undone.
km: តើអ្នកប្រាកដថាចង់លុបកាតាឡុកនេះទេ? លុបហើយមិនអាចត្រឡប់វិញបានទេ

source: Delete
km: លុប

# hold_up_down_drag
source: Hold Up or Down to Drag Sort
km: សង្កត់ឡើងលើឬចុះក្រោមដើម្បីអូសតម្រៀប

source: Add Category
km: ថែមកាតាឡុក

source: Update Category
km: កែប្រែកាតាឡុក

source: Add
km: ថែម

source: Update
km: កែប្រែ

# category_title_en
source: Category Title(English)
km: ឈ្មោះកាតាឡុក(អង់គ្លេស)

# enter_category_title_en
source: Enter category title(English)
km: បញ្ចូលឈ្មោះកាតាឡុក(អង់គ្លេស)

# category_title_km
source: Category Title(Khmer)
km: ឈ្មោះកាតាឡុក(ខ្មែរ)

# enter_category_title_km
source: Enter category title(Khmer)
km: បញ្ចូលឈ្មោះកាតាឡុក(ខ្មែរ)

source: Create
km: បង្កើត

source: Title
km: ឈ្មោះ

# enter_tracking_title
source: Enter title
km: បញ្ចូលឈ្មោះ

source: Enter Amount
km: បញ្ចូលចំនួន

source: Select Date
km: ជ្រើសរើសកាលបរិច្ឆេទ

# descprition
source: Description
km: លម្អិត

# enter_descprition
source: Enter description (optional)
km: បញ្ចូលលម្អិត (អត់ក៏បាន)

source: Search
km: ស្វែងរក

# no_tracking_found
source: No trackings found
km: រកមិនឃើញ

source: Jan
km: មករា

source: Feb
km: កុម្ភៈ

source: Mar
km: មីនា

source: Apr
km: មេសា

source: May
km: ឧសភា

source: Jun
km: មិថុនា

source: Jul
km: កក្កដា

source: Aug
km: សីហា

source: Sep
km: កញ្ញា

source: Oct
km: តុលា

source: Nov
km: វិច្ឆិកា

source: Dec
km: ធ្នូ

source: Setting Category
km: កំណត់កាតាឡុក

source: Your Saving
km: សន្សំ

source: Select End Date
km: ជ្រើសរើសកាលបរិច្ឆេទបញ្ចប់

# goal_saving
source: Goal
km: គោលដៅសន្សំ

source: Current Amount
km: ចំនួនបច្ចុប្បន្ន

source: End Date
km: កាលបរិច្ឆេទបញ្ចប់

source: Add Saving Amount
km: បន្ថែមចំនួនសន្សំ

source: Empty
km: ទទេរ

# no_saving_yet
source: No saving yet. Create your first saving goal now!
km: មិនមានការសន្សំទេ, បង្កើតគោលដៅសន្សំដំបូងរបស់អ្នកឥឡូវនេះ!

source: Create Saving Goal
km: បង្កើតគោលដៅសន្សំ

source: No record found
km: មិនមានកំណត់ត្រា

source: Add Record
km: បន្ថែមកំណត់ត្រា

source: Created
km: បានបង្កើត

# your_tracking_create_successfully
source: Your {tracking} has been created successfully.
km: {tracking} បានបង្កើតដោយជោគជ័យ

source: Daily Saving Reminder
km: ការជូនដំណឹងសន្សំប្រចាំថ្ងៃ

# rememeber_for_saving
source: Remember to save for {saving}
km: កុំភ្លេចមើលការសន្សំចំពោះ {saving}

source: Currency
km: រូបិយប័ណ្ណ

source: Press here to change currency
km: ចុចទីនេះដើម្បីប្តូររូបិយប័ណ្ណ

# usd
source: USD (Dollar)
km: USD (ដុល្លារ)

# khr
source: KHR (Reil)
km: KHR (រៀល)
